
# Тренировки по алгоритмам 3.0

> :warning: **Для более удобного взаимодействия используйте `index.html`**

К сожалению, GitHub не обрабатывает Markdown и HTML в полном объеме, как хотелось бы.

>[!hint] README > Результаты в конце файла. 

Сайты: [1.0](https://yandex.ru/yaintern/algorithm-training_1), [2.0](https://yandex.ru/yaintern/algorithm-training_2), [3.0](https://yandex.ru/yaintern/algorithm-training) (13 февраля — 13 марта 2023).

Дивизионы: `A` — для олимпиадников, `B` — для "простых смертных".

09.02.23 | [вступление](https://youtube.com/live/o3IXpX8wxjQ) на YouTube. 


## Запуск тестов

`poetry run python checker/main.py x y z` , где:
- `x` —  день
- `y` — задание
- `z` — тест (либо номер, либо `+` (`*` нельзя) для прогона всех тестов, которые есть в папке)

или внутри виртуального окружения:

```bash
poetry shell
python checker/main.py x y z
``` 


## Дополнения

- `0` входит в последовательность целых неотрицательных чисел
- При арифметическом округлении добавляем 0,5 и берем `int()`:
	- `10.4` => 10
	- `10.5` => 11
	- `10.6` => 11
- Не используйте `exit()` с целью выхода — программа падает в ошибку. Достаточно продолжить программу, она сама закончится.  Возможно, `exit(0)` работает, но не проверял.


## Обработка входных данных

### Python 

```python
# Считать строку (до перевода строки): 
s = input()

# Считать число из строки (если в ней всего одно число): 
x = int(input())

# Считать несколько чисел из одной строки:
x, y = map(int, input().split())

# Считать список чисел из одной строки:
lst = list(map(int, input().split()))

# Нарезать строку на слова:
words = input().split()

# Удалить пробелы в начале и конце строки:
s = s.strip()

# Чтение неизвестного количества строк лучше делать из файла (в тестирующей системе обычно файл называется `input.txt`).
# Например, в первой строке записано какое-то число, а в следующих строках какой-то текст неизвестной длины. Тогда чтение лучше сделать так:
with fin as open('input.txt', 'r'):
	x = fin.readline() # число из первой строки
	lines = fin.readlines() # все остальные строки
```
 

### C++

Считать одно слово (символы до пробела, табуляции или конца строки). При чтении следующего слова все пробельные символы будут пропущены и туда попадет только второе слово: 
```c++
std::string word;
std::cin >> word;
```

Считать строку до перевода строки:
```c++
std::string line;
std::getline(std::cin, line);
```

Вывести все слова, которые есть в строке (аналогично можно получить все числа из строки): 
```c++
# include <sstream>
# include <iostream>

int main() {
	std::string line, word;
	std::getline(std::cin, line);
	std::stringstream ss;
	ss << line;
	while (ss >> word) {
		std::cout << word << std::endl;
	}
return 0;
}
```

Чтение неизвестного количества чисел. Лучше воспользоваться файлом (в тестирующей системе `input.txt`):
```c++
# include <fstream>

using namespace std;

int main() {
	ifstream fin("input.txt");
	int x;

	while (fin >> x) {
		// do something with x
	}

	fin.close();
	return 0;
}
```

Чтение числа и строки после него. Например, в первой строке задается число, а во второй - строка, оканчивающаяся переводом строки. Вот такой способ:
```c++
int x;
string line;
cin >> x;
getline(cin, line);
```

приведет к тому, что line будет пустым. Это происходит потому что после числа в первой строке содержится перевод строки и он попадает в переменную line (getline "дочитывает" текущую строку до конца, а наше чтение числа остановилось после последней цифрой, за ней только перевод строки). Правильно писать так:
```c++
int x;
string line;
cin >> x;
getline(cin, line);
getline(cin, line);
```

  
## Debug

Работает только в VS Code. Подробнее про [debugpy](https://github.com/microsoft/debugpy/).
  
Последовательность действий:
- Добавляем код ниже в нужный `solution.py`
- Ставим красный breakpoint на полях
- Запускаемся через командную строку
- На вкладке **Run and debug** запускаем конфигурацию **Attach**

```python
### >>>>>>
import debugpy
debugpy.listen(5678)
print("Waiting for debugger")
debugpy.wait_for_client()
### <<<<<<
```
  
> [!Warning] 
> Так как `debugpy` пишет в stdout `Waiting for debugger`, то ответы в `ans*.txt` файлах будут искажаться наличием лишней записи в первой строке. 


## Результаты

Колонки:

- **status** --- статус задачи: решена, нет? Какими языками?
- **tests** --- 5(3): 5 - количество локальных тестов, 3 - количество стандартных тестов. Могли быть добавлены дополнительные тесты, которых не было в условии задачи. Подробнее о добавленных тестах в соответствующих файлах `_desc.rst`.
- **id** --- номер задачи
- **title** --- наименование задачи
- **comment** --- комментарий

Статусы:

- ✅ --- прошли все тесты (`py`)
- ⌛ --- частичное решение (какие-то тесты не пройдены)
- ❌ --- нет решения 

Ошибки (в контексте):

- `RE` --- (*Runtime Error*) ошибка в программе или языке (исключения, ...)
- `WA` --- (*Wrong Answer*) ошибка алгоритма
- `TL` --- (*Time Limit*) превышен лимит времени на выполнение (бывает, достаточно заново отправить)


### 13.02.23 | Day 1 | Новые задания к прошлым темам лекций

| Status | id  | title                     | коммент                                            |
| ------ | --- | ------------------------- | -------------------------------------------------- |
| ✅     | 1   | Гистограмма               | Py ✅                                              |
| ❌     | 2   | Красивая строка           |                                                    |
| ✅     | 3   | Коллекционер Диего        | С++ ✅, Py ⌛ (4 тeст)                             |
| ✅     | 4   | Контрольная работа        |                                                    |
| ❌     | 5   | Хорошая строка            |                                                    |
| ❌     | 6   | Операционные системы lite |                                                    |
| ⌛     | 7   | SNTP                      | C++ ⌛ 2 тест, Py ⌛ 9 тест. 5 на округление int() |
|        | 8   | Минимальный прямоугольник |                                                    |
|        | 9   | Сумма в прямоугольнике    |                                                    |
|        | 10  | Скучная лекция            |                                                    |

### 15.02.23 | Day 2 | Стеки

[Лекция](https://www.youtube.com/watch?v=ZUpImO_2hmA), Конспект (`checker/day_2/index.html`)

| Status |  Tests  | id  | title                                   | comment |
| ------ | ----- | --- | --------------------------------------- | ------- |
| ✅     |  5(3)  | 11  | Стек с защитой от ошибок                |         |
| ✅     |  3(0)  | 12  | Правильная скобочная последовательность |         |
| ✅     |  1(0)  | 13  | Постфиксная запись                      |         |
| ✅     |  3(0)  | 14  | Сортировка вагонов lite                 |         |
| ✅     |  1(0)  | 15  | Великое Лайндское переселение           | Ближайшее меньшее справа         |
 

### 17.02.23 | Dat 3 | Очереди, деки и приоритетные очереди

Лекция, Конспект

| Status | Tests | id  | title | comment |
| ------ | ----- | --- | ----- | ------- |
|        |       | 16  |       |         |


